# Завдання 1
print("Programming", "Essential", "in", sep = '***', end = '...')
print("Python")

# Завдання 2
print('     *\n'
      '    *','*\n'
      '   *','  *\n'
      '  *','    *\n'
      ' ***', '  ***\n'
      '   *', '  *\n'
      '   *', '  *\n'
      '   *****')

# Завдання 3
print("I'm student")

# Завдання 4
print('"I\'m"\n\"\"learning\"\"\n\"\"\"Python\"\"\"')

# Завдання 5
print((5 * 8 ** 2) + (0 * 8 ** 1) + (0 * 8 ** 0))

# Завдання 6
print((7 * 16 ** 2) + (7 * 16 ** 1) + (7 * 16 ** 0))
